In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.arange(6).reshape((2, 3))
df = pd.DataFrame(
    data, 
    index=pd.Index(['Ohio', 'Colorado'], name='state'),
    columns=pd.Index(['one', 'two', 'three'], name='number')
)
df

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [ ]:
df.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [ ]:
# From a hierarchically indexed Series, you can rearrange the data back into a DataFrame with unstack
df.stack().unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [ ]:
url = "https://raw.githubusercontent.com/statsmodels/statsmodels/refs/heads/main/statsmodels/datasets/macrodata/macrodata.csv"
data = pd.read_csv(url)

In [ ]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959,1,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959,2,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959,3,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959,4,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960,1,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

## DATA CLEANING AND PREPARATION

In [3]:
data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado']) 
data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
data[0] = None
data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
data.dropna()

1    artichoke
3      avocado
dtype: object

In [7]:
data[data.notnull()]

1    artichoke
3      avocado
dtype: object